<?php
$a = 12;
$b = 9;

if ($a % 2 == 0 && $b % 2 == 0) {
    echo "обидва числа парні- $a i $b";
} elseif ($a % 2 === 0) {
    echo "--перше число $a парне";
} else ($b % 2 === 0); {
    echo "--друге число $b непарне";
}
?>
<hr>
<?php
$c = 10;
$d = 3;
if ($c == 0) {
    echo "на нуль ділити не можна";
} elseif ($c % $d == 0) {
    echo "Число $c ділиться на $d без остатку";
} else {
    $remainder = $c % $d;
    echo "Число $c НЕ ділиться на $d. Остаток: $remainder";
}
?>
<hr>

<?php
$year = 2025;
if (($year % 400 == 0) || ($year % 4 && $year % 100 !== 0)) {
    echo "$year - високосний рік";
} else {

    echo "$year - НЕ високосний рік";
}
?>